jedarden/spaxel/firmware/sdkconfig.defaults
# SPAXEL Firmware Configuration Defaults
# Target: ESP32-S3

# Chip target
CONFIG_IDF_TARGET="esp32s3"

# Flash size — partitions.csv requires ~3.9MB (factory 1.9MB + ota_0 1.9MB + otadata)
# Using 4MB as minimum supported flash. Safe on 16MB boards: spi_flash only panics
# when physical < header, not when physical > header.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# WiFi CSI Configuration. CSI needs only the enabled flag below. The former
# CONFIG_ESP_WIFI_RX_BCN_ADAPT / _THRESHOLD lines were removed 2026-09-04:
# neither symbol exists in any ESP-IDF release, so both were silently dropped
# on every reconfigure.
CONFIG_ESP_WIFI_CSI_ENABLED=y

# WiFi power save disabled for stable CSI
CONFIG_PM_ENABLE=n

# FreeRTOS configuration for dual-core
CONFIG_FREERTOS_UNICORE=n

# BLE configuration
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
# The former BT_BLE_42_FEATURES_SUPPORTED / BT_BLE_RPA_SUPPORTED /
# BTDM_CTRL_MODE_* lines were removed 2026-09-04: they are Bluedroid and
# ESP32-classic-controller symbols, and this target runs NimBLE on an
# ESP32-S3, whose BT controller is BLE-only, so none of them exist here and
# every line was silently dropped on each reconfigure. NimBLE's RPA is
# already handled by CONFIG_BT_NIMBLE_RPA_TIMEOUT (IDF default 900s).

# Increase main task stack for WiFi/BLE operations
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# esp_http_client options. This component serves the OTA firmware download
# (ota_task in main/websocket.c) — it is not the WebSocket control channel.
#
# HTTPS must stay ON: the mothership advertises SPAXEL_ADVERTISED_BASE_URL,
# and production sets it to https://spaxel.ardenone.com, so every OTA URL a
# node receives is https://. With =n the client cannot open a TLS connection
# and every update fails before the first byte lands in the OTA slot.
# Certificates validate against the compiled-in CA bundle
# (CONFIG_MBEDTLS_CERTIFICATE_BUNDLE, already linked for the wss:// control
# channel); for a plain-http bench URL the bundle is simply unused.
# See spaxel-bbe7f6fc / ADR-004.
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=n

# Log levels
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Watchdog configuration.
#
# Previously disabled, which meant a hung task left the node unreachable
# forever — and on real hardware the only recovery was a physical USB replug.
# For nodes mounted around a living space that is the difference between a
# transient glitch and a trip up a ladder, so the watchdog is now ON.
#
# The timeout is deliberately generous relative to the 60s OTA boot-validation
# window + 60s boot-good window: ESPHome shipped a regression (2026.4.0)
# where a too-aggressive task watchdog reset devices BEFORE that window closed
# and triggered spurious OTA rollbacks. Tune these two together, never
# independently. See bf-2tgcx.
#
# The window that matters is armed in code, not here: watchdog_init()
# (firmware/main/watchdog.c, called early in app_main, before wifi_init())
# reconfigures the running TWDT to SPAXEL_WATCHDOG_TIMEOUT_S — 90s, pinned in
# watchdog.h, which is the single place to tune it. ESP-IDF caps this Kconfig
# symbol at 60 ("range 1 60" in components/esp_system/Kconfig) and silently
# drops a larger value on every reconfigure rather than erroring: 150 was set
# here until 2026-09-05 and configured nothing. 60 is the ceiling, and it only
# covers startup (IDF init until watchdog_init() runs), where the idle tasks
# are the only subscribers.
#
# Corrected 2026-09-05 (with ADR-004): the two boot windows are sequential,
# not additive — the 60s boot-good timer starts only after OTA validation
# succeeds (confirm_ota_valid(), websocket.c), so the rollback-critical span
# is the 60s validation window (websocket.c SPAXEL_OTA_VALID_TIMEOUT_S), which
# the 90s runtime window covers with 30s of margin. This block used to claim
# the two windows summed to ">120s (150s here)"; that sum was compared against
# a value IDF was discarding, and the 90s runtime window is what actually
# ships.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
CONFIG_ESP_TASK_WDT_PANIC=y

# mDNS
CONFIG_MDNS_MAX_SERVICES=10

# NVS
CONFIG_NVS_ENCRYPTION=n

# OTA — dual-partition rollback support
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# CONFIG_BOOTLOADER_APP_ROLLBACK_COUNT and the duplicate old short name
# CONFIG_APP_ROLLBACK_ENABLE were removed 2026-09-04: no count symbol exists
# in ESP-IDF (rollback is the fixed pending-verify/boot mechanism), and the
# short name was already covered by the line above via sdkconfig.rename.

# OTA — anti-rollback protection (prevents downgrade attacks)
# Uses eFuse-based security version counter. Once a higher version is written,
# the device permanently refuses to boot lower versions, even if an attacker
# can flash the firmware. This is defense-in-depth against mothership compromise.
CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK=y
# The former CONFIG_APP_ANTI_ROLLBACK (old short name, worked only via the
# sdkconfig.rename map) and the *_EFuse / *_EFuse_WP_DISABLE lines were
# corrected 2026-09-04: the EFuse lines name symbols that do not exist, so
# they configured nothing. The real eFuse-side knobs are
# CONFIG_BOOTLOADER_APP_SECURE_VERSION (deliberately left at the IDF default
# of 0 — building an app whose security version exceeds the burned eFuse
# value makes the bootloader refuse to boot it) and
# CONFIG_BOOTLOADER_APP_SEC_VER_SIZE_EFUSE_FIELD (default 16 bits on the
# ESP32-S3). Burning the eFuse counter is a provisioning/release action, not
# a compile-time default.

# Secure Boot V2 — signed app verification
#
# DELIBERATELY NOT ENABLED (corrected 2026-09-04). Every CONFIG_SECURE_BOOT_V2*
# line previously in this block named a symbol that does not exist in
# ESP-IDF 5.x — the enable symbol is CONFIG_SECURE_BOOT — so no firmware build
# ever had Secure Boot on, and the images were signed only by the build, not
# verified by the bootloader. CONFIG_SECURE_BOOT_V2_RSA_SUPPORTED and
# CONFIG_SECURE_BOOT_V2_PREFERRED are target-capability flags, not settings;
# RSA signatures are always 3072-bit, so there is no RSA_MODE_2048 either.
#
# Enabling it for real is a provisioning project, not a config flip: the
# signing key must exist (scripts/generate-signing-key.sh; key storage:
# spaxel-5bf35319) and the verification eFuse must be burned on every node,
# or the bootloader refuses to boot. Until that lands (spaxel-30a23d74), the
# real symbols stay commented out so this file does not claim a protection
# the binary does not have. CMakeLists.txt keys its signing step off
# CONFIG_SECURE_BOOT and activates automatically once this is uncommented.
#
# CONFIG_SECURE_BOOT=y
# CONFIG_SECURE_SIGNED_APPS_RSA_SCHEME=y

# The per-node burn this enablement waits on now exists (2026-09-13):
# firmware/scripts/burn-efuses.sh, procedure in
# docs/notes/esp32s3-efuse-provisioning.md — key digest before enable,
# SECURE_BOOT_EN last; dry-run default, prod-signed live-flash verify gate,
# --confirm-irreversible gate. Burning eFuses does NOT enable
# CONFIG_SECURE_BOOT in the build: flipping that symbol remains owned by
# spaxel-30a23d74's Secure Boot sizing go/no-go.

# Increase partition sizes for OTA
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# LED identification blink (symbol defined in main/Kconfig.projbuild; before
# that file existed this line was a silent no-op and led.c used its own
# identical #ifndef fallback)
CONFIG_SPAXEL_LED_GPIO=8

# PSRAM support — 2MB external PSRAM on ESP32-S3
# Critical for TLS handshake heap measurement (ADR-008 decision 5)
CONFIG_SPIRAM=y
# SPIRAM_USE_* is a choice — exactly one allocation mode. MALLOC wins, which
# is what the TLS heap measurement needs; the former MEMMAP and CAPS_ALLOC
# lines were dead-on-arrival overrides of it.
CONFIG_SPIRAM_USE_MALLOC=y
# TYPE_AUTO discovers the PSRAM chip at boot. The former
# CONFIG_SPIRAM_SIZE_AUTO and CONFIG_SPIRAM_CACHE_WRITETHROUGH lines were
# removed 2026-09-04: neither symbol exists in ESP-IDF 5.x (size detection is
# what TYPE_AUTO does; the cache-writeback option was ESP32-classic only).
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
